import numpy as np


""" st1 = np.array([[0,1,2],[3,4,5],[6,7,8]],
                 [[9,10,11],[12,13,14],[15,16,17]],
                 [[18,19,20],[21,22,23],[24,25,26]]) """
''' test1 = np.array([[[0,1,2],[3,4,5],[6,7,8]],
                  [[9,10,11],[12,13,14],[15,16,17]],
                  [[18,19,20],[21,22,23],[24,25,26]# 길이
                    ]#크기
                        ]#차원
                 ) # 길이 3 차원 3 갯수 3 '''
""" print(test1) """
# (4,4,2) = 2열에 4행 4크기로 나눈 배열
x = np.array([
  [[0,1],[2,3],[4,5],[6,7]]
 ,[[8,9],[10,11],[12,13],[14,15]]
 ,[[16,17],[18,19],[20,21],[22,23]]
 ,[[24,25],[26,27],[28,29],[30,31]]])

# 3차원배열 4개로 4행씩 2열로.

print(x.flatten())
print(x.shape)# 4,4,2 = 3차원배열 4개 4행 2열씩 묶는다
x = np.arange(32).reshape(4,2,4)
print(x)
flat = x.flatten()


print('10번째 원소',flat[9])
print('20번째 원소',flat[19])


""" test2 = np.arange(26).reshape(1,5,3)
print(test2) """


""" 
print((a.flatten())[10])
print((a.flatten())[20])
 """