student_tup = (('211101','최성훈','010-1234-4500',('211102','김은지','010-2230-6540'),('211103','이세은','010-3232-7788')))
# 학생투플
#1)
test = { 'a' : '010'}
student_dic = {'211101' : ['최성훈' , '010-1234-4500'],
               '211102':['김은지' , '010-2230-6540'],
               '211103':['이세은' , '010-3232-7788']} #딕셔너리 생성

for 학번,이름_전화번호 in student_dic.items():
    print(학번,':',이름_전화번호)
# 출력
print('-----------------------------')

#2)
name = input('학번을 입력해주세요')    # 학번을 입력받는다
split_student = student_dic[name] # 학생의 이름의 키값을 입력받고 리스트에서 값을받는다.
print('이름: ',split_student[0]    # 값 0
      ,'학번 :',split_student[1])  # 값 1

print('-----------------------------')
#3) 키의 값 추가하기
student_dic = {}
student_dic['211101'] = ['최성훈','010-1234-4500',4.3]   # 새로운 딕셔너리를 만들어서 출력한다..
student_dic['211102'] = ['김은지','010-2330-6540',3.9]
student_dic['211103'] = ['이세은','010-3232-7788',4.25]
print('학생의 정보 출력')
print(student_dic['211101'])
print(student_dic['211102'])
print(student_dic['211103'])

print('-----------------------------')

# 4)
a = 0
for i,k in student_dic.items(): #반복문을 이용하여 학생들의 값만 받는다
    a = a+k[2]
print(a//3) # 실수형이므로 //